电脑/python/Django/django学习笔记补充.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-08-02 二 18:03 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>django学习笔记补充</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">django学习笔记补充</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 如何根据django的模型对象来获取其对应的表格的名字</a></li>
<li><a href="#orgheadline2">2. 如何使用好django的ImageField</a></li>
<li><a href="#orgheadline3">3. django的messages系统</a></li>
<li><a href="#orgheadline8">4. django项目的部署</a>
<ul>
<li><a href="#orgheadline4">4.1. apache serve 静态文件</a></li>
<li><a href="#orgheadline5">4.2. nginx serve 静态文件</a></li>
<li><a href="#orgheadline6">4.3. apache对接wsgi接口</a></li>
<li><a href="#orgheadline7">4.4. nginx对接wsgi接口</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">如何根据django的模型对象来获取其对应的表格的名字</h2>
<div class="outline-text-2" id="text-1">
<p>
参看 <a href="http://stackoverflow.com/questions/233045/how-to-read-the-database-table-name-of-a-model-instance">这个网页</a> 。
</p>

<p>
答: 
</p>
<pre>
model_instance._meta.db_table
</pre>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline2">如何使用好django的ImageField</h2>
<div class="outline-text-2" id="text-2">
<p>
参考了 <a href="http://gregblogs.com/django-saving-an-image-using-imagefield-explain-a-little/">这篇文章</a> 。
</p>

<p>
ImageField和FileField很类似，除了还多了 <code>width</code> 和 <code>height</code> 属性，然后就是在上传的时候确保文件是图片文件。
</p>

<p>
具体在模型文件中的定义如下:
</p>
<pre>
banner = models.ImageField(upload_to=game_2048_images, blank=True,
                           storage=OverwriteStorage(), default="placeholder.jpg")
</pre>
<p>
上面的 <code>upload_to</code> 是控制图片在计算机中的保存路径，可以直接指定一个文件夹路径，但这通常不够灵活，这里通过一个函数来实现更加灵活的路径指定:
</p>
<pre>
def game_2048_images(instance, filename):
    """
    where image upload to.
    """
    return 'game/2048/images/{}/{}'.format(instance.user.username, filename)
</pre>

<p>
这里具体路径是根据你在 <code>settings</code> 里面指定的 <code>MEDIA_ROOT</code> 而来，然后再指定里面的具体的文件夹路径。我们看到函数还可以接受具体模型对应的实例，从而建立自动根据user用户名来分配不同的文件夹路径。
</p>

<p>
<code>storage=OverwriteStorage()</code> 实现了如果文件名重复则覆盖的逻辑:
</p>
<pre>
class OverwriteStorage(FileSystemStorage):
    '''
    存储文件或图片，如果文件名重复则覆盖。
    '''

    def get_available_name(self, name):
        if self.exists(name):
            os.remove(os.path.join(settings.MEDIA_ROOT, name))
        return name
</pre>


<p>
ImageField 可以和rest_framework的序列化类形成很好的联动，最后序列化之后返回的是文件路径url字符串，测试的时候我们可以如下用django来挂载这些静态资源文件，实际运营的时候则推荐用nginx怎么设置一下url分发。
</p>
<pre>
from django.conf.urls.static import static
from django.conf import settings

if settings.DEBUG:
    urlpatterns += static('/data/', document_root=settings.MEDIA_ROOT)
</pre>

<p>
在保存传过来的图片文件的时候，常规构建form对象也是可行的:
</p>
<pre>
form = Game2048InfoForm(
    request.POST, request.FILES, instance=target_info)

if form.is_valid():
    new_game_info = form.save()
else:
    logger.warning('form invalid')
</pre>

<p>
否则你需要通过:
</p>
<pre>
request.FILES['imgfield']
</pre>

<p>
这样的语法来获取图片内容。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline3">django的messages系统</h2>
<div class="outline-text-2" id="text-3">
<p>
本小节主要参看了 <a href="https://www.webforefront.com/django/setupdjangomessages.html">这个网页</a> 。
</p>

<p>
使用django的messages系统，首先需要如下所示在settings里面进行一些配置：
</p>

<pre>
INSTALLED_APPS = [
    'django.contrib.messages',
    ......
</pre>

<pre>
MIDDLEWARE_CLASSES = [
    'django.contrib.messages.middleware.MessageMiddleware',
    ......
</pre>


<pre>
TEMPLATES = [
    {
         'OPTIONS': {
            'context_processors': [
                'django.contrib.messages.context_processors.messages',
                ......
</pre>

<p>
然后在views那边，使用 <code>messages.add_message()</code> 来往django信息系统里面发送一个信息，此外还有如下的这些快捷方法：
</p>

<ul class="org-ul">
<li>messages.debug()</li>
<li>messages.info()</li>
<li>messages.success()</li>
<li>messages.warning()</li>
<li>messages.error()</li>
</ul>

<p>
你还可以如下设置每个request请求下的信息系统级别：
</p>
<pre>
from django.contrib import messages
messages.set_level(request, messages.DEBUG)
</pre>


<p>
下面我定义了一个简单的flash函数
</p>
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="nf">flash</span><span class="p">(</span><span class="n">request</span><span class="p">,</span> <span class="n">title</span><span class="p">,</span> <span class="n">text</span><span class="p">,</span> <span class="n">level</span><span class="o">=</span><span class="s1">&#39;info&#39;</span><span class="p">):</span>
    <span class="sd">&quot;&quot;&quot;</span>
<span class="sd">    利用django的message系统发送一个信息，对接模板的sweetalert。</span>
<span class="sd">    &quot;&quot;&quot;</span>
    <span class="n">level_map</span> <span class="o">=</span> <span class="p">{</span>
        <span class="s1">&#39;info&#39;</span><span class="p">:</span> <span class="n">messages</span><span class="o">.</span><span class="n">INFO</span><span class="p">,</span>
        <span class="s1">&#39;debug&#39;</span><span class="p">:</span> <span class="n">messages</span><span class="o">.</span><span class="n">DEBUG</span><span class="p">,</span>
        <span class="s1">&#39;success&#39;</span><span class="p">:</span> <span class="n">messages</span><span class="o">.</span><span class="n">SUCCESS</span><span class="p">,</span>
        <span class="s1">&#39;warning&#39;</span><span class="p">:</span> <span class="n">messages</span><span class="o">.</span><span class="n">WARNING</span><span class="p">,</span>
        <span class="s1">&#39;error&#39;</span><span class="p">:</span> <span class="n">messages</span><span class="o">.</span><span class="n">ERROR</span>
        <span class="p">}</span>

    <span class="n">level</span> <span class="o">=</span> <span class="n">level_map</span><span class="p">[</span><span class="n">level</span><span class="p">]</span>

    <span class="n">messages</span><span class="o">.</span><span class="n">add_message</span><span class="p">(</span><span class="n">request</span><span class="p">,</span> <span class="n">level</span><span class="p">,</span> <span class="n">text</span><span class="p">,</span> <span class="n">extra_tags</span><span class="o">=</span><span class="n">title</span><span class="p">)</span>
    <span class="k">return</span> <span class="s1">&#39;ok&#39;</span>
</pre></div>

<p>
之所以做这样的封装是为了更好地对接sweetalert这个javascript库，然后模块加入如下内容从而从而实现信息的具体弹出行为。
</p>

<pre>
{% if messages %}
&lt;script src="{% static 'js/sweetalert.min.js' %}"&gt;&lt;/script&gt;
&lt;script&gt;
{% for msg in messages %}
    sweetAlert({
        title: '{{msg.extra_args}}',
        text: '{{ msg.message }}',
        type: '{{ msg.level_tag }}',
      })
{% endfor %}
&lt;/script&gt;
{% endif %}
</pre>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline8">django项目的部署</h2>
<div class="outline-text-2" id="text-4">
<p>
这里所谓的部署就是用apache或nginx这样的web服务器来对接django项目，说的再具体一点就把django作为一个wsgi程序服务起来。
</p>


<p>
django的静态文件和django项目的部署是密不可分的，严格讲起来django项目部署的时候其静态文件都是依赖于apache或者nginx这样的web服务器的。具体在这些工具的配置文档里面都有描述，大体是类似这样的配置：
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline4">apache serve 静态文件</h3>
<div class="outline-text-3" id="text-4-1">
<pre>
&lt;VirtualHost *:80&gt;
    ......
  
    Alias /media/ /path/to/media/
    Alias /static/ /path/to/static/
  
    ......
&lt;/VirtualHost&gt;
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline5">nginx serve 静态文件</h3>
<div class="outline-text-3" id="text-4-2">
<pre>
server {
    listen      80;
    ......
 
    client_max_body_size 75M;
 
    location /media  {
        alias /path/to/media;
    }
 
    location /static {
        alias /path/to/static;
    }
    
    ......
}
</pre>

<p>
然后所谓的 <code>python manage.py collectstatic</code> 命令就是为了把整个项目的静态文件都收集到一个文件夹里面来方便这些web服务器来serve 。
</p>

<p>
django的这个配置也是必要的：
</p>
<pre>
INSTALLED_APPS = [
    'django.contrib.staticfiles',
    ......
</pre>

<p>
而我们谈论的修改url的那种做法只是在开发django项目的时候不想麻烦web服务器而这样做的修改。
</p>


<pre>
urlpatterns = [
  ......

] + static('/data/', document_root=settings.MEDIA_ROOT)
</pre>


<p>
然后接下来就是web服务器要把django的wsgi接口对接好。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline6">apache对接wsgi接口</h3>
<div class="outline-text-3" id="text-4-3">
<pre>
&lt;VirtualHost *:80&gt;
    ......
  
    WSGIScriptAlias / /path/to/mysite.com/mysite/wsgi.py
    WSGIPythonPath /path/to/mysite.com

&lt;/VirtualHost&gt;
</pre>

<p>
apache能这么直接对接wsgi接口是因为它装了mod_wsgi模块
</p>
<pre>
# Python 2
sudo apt-get install libapache2-mod-wsgi
 
# Python 3
sudo apt-get install libapache2-mod-wsgi-py3
</pre>

<p>
apache服务django的wsgi.py文件还需要做一些修改：
</p>
<pre>
import os
from os.path import join,dirname,abspath
 
PROJECT_DIR = dirname(dirname(abspath(__file__)))
import sys
sys.path.insert(0,PROJECT_DIR) 
 
os.environ["DJANGO_SETTINGS_MODULE"] = "blog.settings"
 
from django.core.wsgi import get_wsgi_application
application = get_wsgi_application()
</pre>

<p>
apache这边还有很多文件夹访问权限的控制配置，大体如下所示：
</p>

<pre>
&lt;Directory /path/to/mysite.com/static&gt;
Require all granted
&lt;/Directory&gt;

&lt;Directory /path/to/mysite.com/media&gt;
Require all granted
&lt;/Directory&gt;

WSGIScriptAlias / /path/to/mysite.com/mysite/wsgi.py

&lt;Directory /path/to/mysite.com/mysite&gt;
&lt;Files wsgi.py&gt;
Require all granted
&lt;/Files&gt;
&lt;/Directory&gt;
</pre>


<p>
更多细节请参看 <a href="https://docs.djangoproject.com/en/1.9/howto/deployment/wsgi/modwsgi/">官方文档</a> 。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline7">nginx对接wsgi接口</h3>
<div class="outline-text-3" id="text-4-4">
<p>
nginx要对接wsgi接口需要uwsgi这个模块将wsgi接口服务起来。
</p>

<pre>
pip install uwsgi
</pre>

<p>
更多细节请参看uwsgi的 <a href="http://uwsgi-docs.readthedocs.io/en/latest/tutorials/Django_and_nginx.html">官方文档</a> 。
</p>

<p>
ngnix的配置如下：
</p>
<pre>
upstream django {
    server 127.0.0.1:8001; 
}

server {
    location / {
        uwsgi_pass  django;
        include     /path/to/your/mysite/uwsgi_params; 
    }
}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
